SET NAMES 'utf8';
CREATE DATABASE xiailvzhi CHARSET=UTF8;
USE xiailvzhi;

CREATE TABLE kf_dish(
    did INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64),
    price FLOAT(6,2),
    img_sm VARCHAR(64),
    img_lg VARCHAR(64),
    detail VARCHAR(2048),
    material VARCHAR(2048)
);
INSERT INTO kf_dish(did,img_sm,img_lg,name,price,material,detail) VALUES
(   null,
    'flower_s_01.jpg',
    'flower_l_01.jpg',
    '【栀子花】',
    15.8,
    '四季常绿，花芳香素雅，绿叶百花，清丽可爱',
    '栀子花（学名：Gardenia jasminoides），又名栀子、黄栀子，龙胆目茜草科。属茜草科，为常绿灌木，枝叶繁茂，叶色四季常绿，花芳香，为重要的庭院观赏植物。除观赏外，其花、果实、叶和根可入药，有泻火除烦，清热利尿，凉血解毒之功效。单叶对生或三叶轮生，叶片倒卵形，革质，翠绿有光泽。浆果卵形，黄色或橙色。喜光照充足且通风良好的环境，但忌强光曝晒。'
),
(   null,
    'flower_s_02.jpg',
    'flower_l_02.jpg',
    '【九里香】',
    13.8,
    '树姿秀雅，枝干苍劲，洁白而芳香，四季常绿',
    '九里香（学名：Murraya exotica），又称：石辣椒、九秋香、九树香、七里香、千里香、万里香、过山香、黄金桂、山黄皮、千只眼、月橘。拉丁文名：Murraya exotica L.芸香科、九里香属常绿灌木，有时可长成小乔木样，株姿优美，枝叶秀丽，花香浓郁。根、茎、叶所含化学成分与千里香类同，产台湾、福建、广东、海南、广西五省区南部。常见于离海岸不远的平地、缓坡、小丘的灌木丛中。喜生于砂质土、向阳地方。南部地区多用作围篱材料，或作花圃及宾馆的点缀品，亦作盆景材料。'
),
(   null,
    'flower_s_03.jpg',
    'flower_l_03.jpg',
    '【豆瓣绿】',
    13.8,
    '青翠碧绿，清新悦目，优雅美丽',
    '豆瓣绿是胡椒科草胡椒属多年生常绿草本植物。原产于西印度群岛、巴拿马、南美洲北部。后来传入中国，一般作为盆栽装饰用，以其明亮的光泽和自然地绿色受到广泛欢迎。现主要分布在台湾、福建、广东、广西、贵州、云南、四川及甘肃南部和西藏南部。生于潮湿的石上或枯树上。分布于美洲、大洋洲、非洲及亚洲热带和亚热带地区。全草药用。内服治风湿性关节炎、支气管炎；外敷治扭伤、骨折、痈疮疖肿等。'
),
(   null,
    'flower_s_04.jpg',
    'flower_l_04.jpg',
    '【粉掌】',
    24.8,
    '花芬香素雅，清新悦目，优雅美丽',
    '粉掌，正名：粉冠军，为天南星科花烛族花烛属多年生常绿草本花卉。粉掌的花朵独特，佛焰苞明艳华丽，色彩丰富，极富变化，且花期长，水培单朵花期可达2—4个月。是一种有较大发展前景的名优花卉。可水培可土栽，水培要避免阳光、一个月见一次阳光就好。'
),
(   null,
    'flower_s_05.jpg',
    'flower_l_05.jpg',
    '【长寿花】',
    15.8,
    '花芬香素雅，清新悦目，优雅美丽',
    '圣诞伽蓝菜（学名：Kalanchoe blossfeldiana Poelln.）：又名“长寿花”。多年生肉质草本。株高10-30厘米。茎直立。单叶对生，椭圆形，缘具钝齿。聚伞花序；小花橙红至绯红色。蓇葖果。种子多数。花期2-5月。叶片密集翠绿，临近圣诞节日开花，拥簇成团，花色丰富，是惹人喜爱的室内盆栽花卉。此花是由德国人波茨坦（R．Blossfeld）自非洲南部引入欧洲。但直到20世纪30年代才在欧洲较广泛的栽培观赏。至今，世界的花卉出口大国荷兰，1995年长寿花的产值己达到3330亿美元，列盆花生产的第三位。在丹麦，盆栽长寿花已成为丹麦盆栽花卉之冠，产量与产值均列第一位。说明长寿花在盆栽花卉中占有重要的地位，并成为国际花卉市场中发展最快的盆花之一。'
),
(   null,
    'flower_s_06.jpg',
    'flower_l_06.jpg',
    '【康乃馨】',
    17.6,
    '体态玲珑，斑斓雅洁，端庄大方，芳香清幽',
    '康乃馨，原名：香石竹，英文名：Dianthus caryophyllus.又名：狮头石竹、麝香石竹、大花石竹，拉丁文名：Dianthus caryophyllus L. 石竹科、石竹属多年生草本，高40-70厘米，全株无毛，粉绿色。茎丛生，直立，基部木质化，上部稀疏分枝。叶片线状披针形，顶端长渐尖，基部稍成短鞘，中脉明显，上面下凹，下面稍凸起。花常单生枝端有香气，粉红、紫红或白色；花梗短于花萼；宽卵形，顶端短凸尖，花萼圆筒形，萼齿披针形，边缘膜质；瓣片倒卵形，顶缘具不整齐齿；雄蕊长达喉部；花柱伸出花外。蒴果卵球形，稍短于宿存萼。花期5-8月，果期8-9月。'
),
(   null,
    'flower_s_07.jpg',
    'flower_l_07.jpg',
    '【吊兰】',
    14.8,
    '舒展散垂似花朵，四季常绿',
    '吊兰（学名：Chlorophytum comosum（Thunb.）Baker.），吊兰又称：垂盆草、挂兰、钓兰、兰草、折鹤兰，西欧又叫蜘蛛草或飞机草，原产于南非。单子叶植物纲、百合科、吊兰属多年生常绿草本植物，根状茎平生或斜生，有多数肥厚的根。叶丛生，线形，叶细长，似兰花。有时中间有绿色或黄色条纹。花茎从叶丛中抽出，长成匍匐茎在顶端抽叶成簇，花白色，常2-4朵簇生，排成疏散的总状花序或圆锥花序偶然内部会出现紫色花瓣；蒴果三棱状扁球形，长约5毫米，宽约8毫米，每室具种子3-5颗。花期5月，果期8月。植株有净化空气的作用，全株可入药。'
),
(   null,
    'flower_s_08.jpg',
    'flower_l_08.jpg',
    '【太阳神】',
    16.8,
    '叶片坚挺直立，对环境的适应能力强',
    '别名：绿密龙血树、阿波罗千年木、密叶龙血树。是竹蕉类，为木本植物。也能开花，但花的观赏价值不高，在家庭养护中开花少见，只在原产地或热带地区可见。喜散射光照，不耐强光直射，否则叶易由绿变黄枯或黄褐色。但冬季低温期可以充足的光照养护。比较喜水，但在温度低于20℃时要以干湿交替进行浇水，适宜的生长温度为20-35℃之间，比较粗放。施肥可每月进行一次，但要少量为宜，由于盆栽者多小巧，所以以疏松肥沃的砂质土为好。'
);

##SELECT * FROM kf_dish;

CREATE TABLE kf_order(
    oid INT PRIMARY KEY AUTO_INCREMENT,
    phone VARCHAR(16),
    user_name VARCHAR(16),
    sex INT,    /*1:男  2:女*/
    order_time LONG,
    addr VARCHAR(256),
    did INT
);
INSERT INTO kf_order(oid, phone,user_name,sex,order_time,addr,did) VALUES
(NULL,'13501234567','婷婷',2,1445154859209,'大钟寺中鼎B座',3),
(NULL,'13501234567','婷婷',2,1445254959209,'大钟寺中鼎B座',2),
(NULL,'13501234567','婷婷',2,1445354959209,'大钟寺中鼎B座',5);

##SELECT * FROM kf_order;